simplify deployment guide.
